; TaskSwitchXP Pro 2.05 English Language File (Template)
; Translated by Alexander Avdonin <alexander@ntwind.com>

;##############################################################################
; Changes for version 2.06 (May 16, 2005)
; Added strings:
;   => 20111="Add minimized to tray windows to the end of Alt-Tab list"
;##############################################################################


;##############################################################################
; TaskSwitchXP enumerates all *.LNG files into .\lang subfolder!
; To add a language for TaskSwitchXP:
;     1) translate this file;
;     2) save it as <NewLanguage>.lng in UNICODE format
;        (for Notepad: select File->Save_As and then choose Unicode encoding);
;     3) test it before submitting!!!
;
; Translations forum/tracker: http://www.ntwind.com/forum/viewforum.php?f=3
;
; I will include some translations to my official release (if you accept!)...
; Please put your e-mail address for feedback somewhere!


; There are a few special characters (two symbols are recognized as one):
;     1) carriage return and new line:  \r\n
;     2) tab:  \t
;     3) quotation mark:  \"
;     4) back slash:  \\


; NOTE: These language files will generally work with future versions of 
;       TaskSwitchXP, but some strings will appear in English. I will put a 
;       change log for future versions in the comments of this file.
;##############################################################################


; Currently TaskSwitchXP uses *.LNG file names for language identifying.
; This string is ignored. Please put here for future versions:
;     19999="English_LanguageName (Native_LanguageName)"
;     e.g. 19999="German (Deutsch)"
19999="Japanese (日本語)"


; Cofiguration
20000="TaskSwitchXP Pro 2.0 設定画面"
20001="OK"
20002="中止"
20003="適用"

; Filters
20031="TaskSwitchXP 設定ファイル(*.cfg)"


; Pages
20050="一般設定"
20051="外観設定"
20052="タスクリスト"
20053="プレビュー"
20054="タスク情報"
20055="ホットキー"
20056="除外設定"
20057="詳細設定"
20058="バージョン情報"

; Page descriptions
20070="一般的な設定"
20071="外観スタイルの設定"
20072="タスクリスト"
20073="プレビューの設定"
20074="タスク情報"
20075="TaskSwitchXP　ホットキーの設定"
20076="TaskSwitchXP　除外設定 "
20077="詳細な設定"
20078="TaskSwitchXPについて"


; General page
20100="言語:"
20101="<a id=\"idLang\" href=\"\">さらなる言語を検索</a>"
20102="ログインユーザー毎に設定する"
20103="システムスタートアップでTaskSwitchXPを起動する"
20104="TaskSwitchXPの優先度を　高　にする"
20105="Ms製パワートーイのタスクスイッチャの稼働をチェックする"
20106="トレイアイコン:"
20107="起動と同時にシストレイアイコンを表示する"
20108="カスタムアイコンを使用する:"
20109="最小化ボタンを右クリックでトレイに最小化する"
20110="ﾂｰﾙﾊﾞｰを自動で隠す機能が有効でもTaskSwitchXPﾄﾚｲｱｲｺﾝは維持"
20111="Alt-Tabリストが終了してもトレイに最小化は有効にする"

20120="デフォルトに戻す"
20121="読み込み"
20122="保存"

; Appearance page
20200="画面ポジション:"
20201="アクティブモニタを表示"
20202="TaskSwitchXPウィンドウの影を描画"
20203="TaskSwitchXPウィンドウで半透明機能を有効にする:"
20204="フェイドイン効果を有効にする (ミリ秒):"
20205="フェイドアウト効果を有効にする (ミリ秒):"
20206="描画モードの設定:"
20207="XP Visual style:"
20208="クラシックスタイル:"
20209="常時強制的にTaskSwitchXPクラシックスタイル"
20210="左右ペインを入れ換え"

; Position on screen
20270=" 上 - 左 "
20271=" 上 - 中央 "
20272=" 上 - 右 "
20273=" 中央 - 左 "
20274=" ど真ん中 "
20275=" 中央 - 右 "
20276=" 下 - 左 "
20277=" 下 - 中央 "
20278=" 下 - 右 "

; Modern XP skins
20280="スタートパネルスタイル (デフォルト)"
20281="パワートーイタスクスイッチャスタイル"
20282="シンプルスタイル"
20283="フラットXPスタイル"
20284="シフトXPスタイル"
20285="タスクバースタイル"

; Classical skins
20290="スタートパネルスタイル (デフォルト)"
20291="フラットスタートパネルスタイル"


; Task List page
20300="リストビュー:"
20301="列の数:"
20302="幅 (ピクセル):"
20303="行の数:"
20304="小アイコン"
20305="アイコンリスト上でツールチップ"
20306="ホットトラックアイテムにハンドカーソルを使用"
; or something like 20307="Enable mouse over selection", 
; I've translated it to Russian as: 20307="Select list item under cursor"
20307="ホットトラック効果を有効にする"
20308="マウスホイールの上下を反転"
20309="選択スタイル:"
20310="枠を描画する"
20311="テキストのスタイル:"
20312="フォント:"
20313="サイズ:"
20314="太"
20315="斜"
20316="色の取得:"

; List views
20390="アイコン"
20391="縦型リスト"

; Selection styles
20380="フレーム"
20381="枠で浮き出す"
20382="枠だけ"

; Color indexes
20370="プレーンテキスト"
20371="テキスト選択"
20372="背景"
20373="テキスト1としてマーク"
20374="背景1としてマーク"
20375="テキスト2としてマーク"
20376="背景2としてマーク"


; Preview page
20400="プレビュースタイル:"
20401="\"デスクトップ\" プレビュースタイル"
20402="\"ウィンドウ\" プレビュースタイル"
20403="プレビューイメージにタスクバーを含める"
20404="最近使用したアプリのポップアップだけ描画する"
20405="プレビューに壁紙を描画しない (旧v1.0スタイル)"
20406="デスクトップの壁紙をプレビュー"
20407="プレビューイメージに枠を表示"
20408="中央にプレビューを表示する"
20409="最小化したアプリも表示する (*)"
20410="プレビューでは透明効果を除外する (*)"
20411="プレビューイメージの幅 (ピクセル):"
20412="最初のプレビューを遅延させる (ミリ秒):"
20413="プレビューイメージでキャッシュを使用しない"
20414="リアルタイムプレビューを使用する (ミリ秒):"


; Info page
20500="キャプションペイン:"
20501="フォント:"
20502="サイズ:"
20503="太"
20504="斜"
20505="色:"
20506="影を描画:"
20507="深さ:"
20508="色:"
20509="キャプションペインにアイコンを表示"
20510="小さいキャプションペイン"
20511="情報ペイン:"
20512="フォント:"
20513="サイズ:"
20514="太"
20515="斜"
20516="色:"
20517="影を描画:"
20518="深さ:"
20519="色:"
20520="高さ:"
20521="フォーマット:"

; Info formats
20590="なし"
20591="タスク番号のみ"
20592="プロセス ID"
20593="プロセス名"
20594="プロセス名  [PID]"
20595="プログラムの説明"


; Hotkeys page
20600="Windows標準のAlt-Tabを置き換える"
20601="Ctrl+Alt+[Shift]+Tabでインスタンススイッチャを有効にする"
; or something like 20602="Don't hide TaskSwitchXP window on Alt releasing"
20602="Alt-Tabを\"スティッキ\"モードにする"
; or something like 20603="Use low-level method to replace Alt-Tab"
20603="ローレベルキーボードフックの使用をAlt-Tabに置き換える"
20604="TaskSwitchXPコントロール:"
20605="アプリリスト:"
20606="インスタンスリスト:"
20607="TaskSwitchXPの設定:"
20608="システムトレイに表示/非表示:"
20609="TaskSwitchXPの終了:"
20610="高度なホットキー:"
20611="トレイに最小化:"
20612="トレイから出す:"


; Exclusions page
20700="新規作成"
20701="編集"
20702="削除"

; List groups
20780="プレビューの描画"
20781="Windowの一覧"

20790="名前"
20791="パラメータ"

; Advanced page
20800="Windowのタイトル:"
20801="Windowsメインアプリのキャプションを使用"
20802="高度なインターフェイス設定:"
20803="キャプションペインを削除"
20804="情報ペインを削除"
20805="トレイアイコンのアクション:"
20806="コンテキストメニュー:"
20807="設定:"
20808="アプリケーションリスト:"
20809="インスタンスリスト:"
20810="設定ツールの設定:"
20811="設定画面は常に最前面"
20812="設定画面の位置を記憶する"
20813="設定ページも記憶する"
20814="開始/終了でTaskSwitchXPを開始"

; Tray icon actions
20890="なし"
20891="左クリック"
20892="左ダブルクリック"
20893="中ボタンクリック"
20894="中ボタンダブルクリック"
20895="右クリック"
20896="右ダブルクリック"


; About page

; Information about you: contact email, website, etc.
; PLEASE NO COMMERCIAL ADS, ONLY YOUR PERSONAL INFORMATION!!!
;
; You can place here a text with two links in HTML format:
;   1) <a id=\"idTranslatorHome\" href=\"http://barca.daa.jp\">homepage</a>
;   2) <a id=\"idTranslatorMail\" href=\"mailto:nihongoka@gmail.com">e-mail</a>
; Don't forget about special characters (like as \" and \\) in HTML tags, and 
; check out your links!
;
; You can also place here a salutation for TaskSwitchXP users!  ;)

20900="Translated by <a id=\"idTranslatorMail\" href=\"http://barca.daa.jp\">barlog dai</a>...\r\n他にも色々公開中　^^　"


; Exclusions dialog
22000="TaskSwitchXP除外設定"
22001="OK"
22002="中止"
22003="アクティブなアプリ:"
22004="更新"
22005="除外グループ名:"
22006="条件指定:"
22007="プロセス名:"
22008="ウィンドウクラス:"
22009="ウィンドウタイトル:"
22010="次から除外:"
22011="プレビューの描写"
22012="windowの一覧"
22013="有効"

22090="" ; 除外しない
22091=">> プレビューから除外"
22092=">> 一覧から除外"

; Configurator Errors
30000="TaskSwitchXP設定ツールのエラー"
30002="TaskSwitchXP.exeの起動に失敗しました！もう一度TaskSwitchXPをインストールしてください"
30003="レジストリに登録できませんでした。アクセス権を確認してください。"
30004="ファイルからの読み込みに失敗しました。"
30005="ファイルからの読み込みに失敗しました。デフォルトに戻されます。"
30006="ファイルの保存に失敗しました。"

; Hints for exclusion dialog
30100="除外グループ名がありません"
30101="正しい名前を入力してください"
30102="パラメータがありません"
30103="正しい除外パラメータを入力してください"
30104="プロセス名がありません"
30105="正しいプロセス名を入力してください"
30106="ウィンドウクラスがありません"
30107="正しいクラス名を入力してください"

; Confirmations
30900="TaskSwitchXP確認画面"
30901="TaskSwitchXPはあなたのシステムから複数のディスプレイモニタを検出しました。\r\n \"Window\"プレビューモードを有効にして第2モニタからすべてのプレビューを表示しますか？"


; TaskSwitchXP Language Strings

; Tray menu
31000="アプリケーションリスト"
31001="インスタンスリスト"	
31002="設定"
31003="終了"

31020="クイック設定"
31021="トレイアイコンを隠す"
31022="Alt-Tabを置き換え"
31023="インスタンススイッチャを有効"
31024="Alt-Tabで""スティッキ""モード"
31025="ローレベルキーボードフックを使用"
31026="新規除外項目"

31050="ヘルプ"
31051="説明書"
31052="ホームページ"
31053="TaskSwitchXPについて"

; Tray menu for minimized applications
31090="TSXP: %d app(s)"
31091="すべて復元"
31092="すべて最小化"
31093="すべて閉じる"
31094="復元"
31095="最小化"
31096="終了"

; Task List menu
31110="スイッチ"
31111="最小化"
31112="トレイに最小化"
31113="重ねる"
31114="横に並べる"
31115="縦に並べる"
31116="復元"
31117="最大化"
31118="閉じる"
31119="プロセスを終了"

; Common menu
31150="プロセス情報を表示"
31151="すべて選択"
31152="選択しない"
31153="選択を削除"
31154="タイトルで並び替え"
31155="アプリで並び替え"	

; Process Info mask
; Here are used some terms from Windows Task Manager (Ctrl+Shift+Esc, Processes ; tab, View->Select Columns...)!
; WARNING: Don't replace %x special characters!!!
31500="イメージ名:  %s\r\nプロセスID:  %u\r\n\r\n稼働時間:  %u:%02u:%02u\r\nCPU 時間:  %u:%02u:%02u\r\n\r\nメモリ使用量:  %uK\r\nVM サイズ:  %uK"
31501="N/A" ; プロセス情報がありません

; Confirmations
31900="TaskSwitchXP確認画面"
31901="TaskSwitchXPは既に起動中です。停止しますか？"
31902="本当にTaskSwitchXPを終了しますか？"
31903="TaskSwitchXPはMs製PowerToyタスクスイッチャの稼働を検出しました\r\n終了させてもよろしいですか？"

; Errors
32000="TaskSwitchXPエラー"
32002="登録失敗"
32003="ローレベルキーボードフックのインストールができません"
32004="Alt+Tab か Alt+Shift+Tab の登録ができません。\r\n他のアプリで登録済みの可能性があります。"
32005="Ctrl+Alt+Tab か Ctrl+Alt+Shift+Tab の登録ができません。\r\n他のアプリで登録済みの可能性があります。"
32006="ConfigTsXP.exeが開始できません！TaskSwitchXPを再インストールしてください。"

32500="ホットキーの登録ができません:\r\n\r\n名前: %s\r\n変更者: %02X\r\nVirtual Code: %02X"
32501="TaskSwitchXPの終了"
32502="タスクトレイの表示/非表示"
32503="TaskSwitchXPの設定"
32504="アプリケーションリスト"
32505="インスタンスリスト"
32506="トレイに最小化"
32507="トレイから出す"
